Семена/src/Documents/СборУрожая/СборУрожая.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СборУрожая</name>
  <registerRecords>AccumulationRegister.СобраныйУрожай</registerRecords>
  <attributes>
    <name>Урожай</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборРастений</name>
    <type>
      <types>CatalogRef.НаборыРастений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Растения</name>
    <attributes>
      <name>Растение</name>
      <type>
        <types>CatalogRef.ВысаженнаяРассада</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Семена/src/Documents/СборУрожая/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура НаборРастенийПриИзмененииНаСервере()
	Объект.Растения.Очистить();
	ТЗ = Объект.НаборРастений.Набор.Выгрузить();
	Объект.Растения.Загрузить(ТЗ);
	Объект.Урожай = Объект.НаборРастений.НоменклатураУрожая;
КонецПроцедуры

&НаКлиенте
Процедура НаборРастенийПриИзменении(Элемент)
	НаборРастенийПриИзмененииНаСервере();
КонецПроцедуры
